In [372]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px
import warnings
warnings.filterwarnings('ignore')

In [373]:
df = pd.read_csv("cars.csv")
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [374]:
# Encoding is a method to convert "text data" into "numerical values"
# Encoding -- Types -->  1. One Hot Encoder

In [375]:
# Dummy data
d1 = {"Name":["Abhishek", "Naman", "Rohit"]}

In [376]:
d2=pd.DataFrame(d1)

In [377]:
d2

       Name
0  Abhishek
1     Naman
2     Rohit

In [378]:
name = pd.get_dummies(d2["Name"]).astype(int)

In [379]:
name

   Abhishek  Naman  Rohit
0         1      0      0
1         0      1      0
2         0      0      1

In [380]:
name = pd.get_dummies(d2["Name"],drop_first=True).astype(int)

In [381]:
name

   Naman  Rohit
0      0      0
1      1      0
2      0      1

In [382]:
#######################################################################################################################################################
######################################################################################################################################################

In [383]:
# Now we are working on data --> Cars.csv

In [384]:
df = pd.read_csv("cars.csv")
df.head(3)

    brand  km_driven    fuel         owner  selling_price
0  Maruti     145500  Diesel   First Owner         450000
1   Skoda     120000  Diesel  Second Owner         370000
2   Honda     140000  Petrol   Third Owner         158000

In [385]:
df['owner'].value_counts()

owner
First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: count, dtype: int64

In [386]:
owner = df['owner']

owner = (pd.get_dummies(owner, drop_first = True)).astype(int)
owner

      Fourth & Above Owner  Second Owner  Test Drive Car  Third Owner
0                        0             0               0            0
1                        0             1               0            0
2                        0             0               0            1
3                        0             0               0            0
4                        0             0               0            0
...                    ...           ...             ...          ...
8123                     0             0               0            0
8124                     1             0               0            0
8125                     0             0               0            0
8126                     0             0               0            0
8127                     0             0               0            0

[8128 rows x 4 columns]

In [387]:
fuel = df['fuel']

fuel = (pd.get_dummies(fuel, drop_first = True)).astype(int)
fuel

      Diesel  LPG  Petrol
0          1    0       0
1          1    0       0
2          0    0       1
3          1    0       0
4          0    0       1
...      ...  ...     ...
8123       0    0       1
8124       1    0       0
8125       1    0       0
8126       1    0       0
8127       1    0       0

[8128 rows x 3 columns]

In [388]:
brand = df['brand']

brand = (pd.get_dummies(brand, drop_first = True)).astype(int)
brand

,Ashok,Audi,BMW,Chevrolet,Daewoo,Datsun,Fiat,Force,Ford,Honda,...,Mitsubishi,Nissan,Opel,Peugeot,Renault,Skoda,Tata,Toyota,Volkswagen,Volvo
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
2,0,0,0,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8123,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
8124,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
8125,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
8126,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,1,0,0,0
8127,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,1,0,0,0

In [389]:
df1= pd.concat([df,fuel,owner,brand], axis = 1)

In [390]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [391]:
df.drop(["fuel", "owner", "brand"], axis = 1, inplace=True)

In [392]:
df.head()

   km_driven  selling_price
0     145500         450000
1     120000         370000
2     140000         158000
3     127000         225000
4     120000         130000

In [393]:
# Again read file in other variable
df1 = pd.read_csv("cars.csv")

In [394]:
df1.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [395]:
df1 = df1[["brand", "owner", "fuel"]]

In [396]:
from sklearn.preprocessing import OneHotEncoder

In [397]:
ohe = OneHotEncoder(drop = 'first', sparse_output = False, dtype = np.int32)

In [398]:
df1 = ohe.fit_transform(df1) # Learn and convert

In [399]:
df1

array([[0, 0, 0, ..., 1, 0, 0],
       [0, 0, 0, ..., 1, 0, 0],
       [0, 0, 0, ..., 0, 0, 1],
       ...,
       [0, 0, 0, ..., 1, 0, 0],
       [0, 0, 0, ..., 1, 0, 0],
       [0, 0, 0, ..., 1, 0, 0]])

In [400]:
df2=pd.DataFrame(df1)
df2.head()

,0,1,2,3,4,5,6,7,8,9,...,28,29,30,31,32,33,34,35,36,37
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,1,0,0
2,0,0,0,0,0,0,0,0,0,1,...,0,0,0,0,0,0,1,0,0,1
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1

In [401]:
########################################################################################################################################################
########################################################################################################################################################

In [402]:
# Second Type of Encoding --> Ordinal Encoding.
# Ordinal has two types

In [403]:
dataset = pd.read_csv("customer.csv")
dataset.head()

   age  gender   review education purchased
0   30  Female  Average    School        No
1   68  Female     Poor        UG        No
2   70  Female     Good        PG        No
3   72  Female     Good        PG        No
4   16  Female  Average        UG        No

In [404]:
dataset['review'].value_counts()

review
Poor       18
Good       18
Average    14
Name: count, dtype: int64

In [405]:
dataset['review'] = dataset['review'].map({"Poor":0, "Average":1, "Good":2})

In [406]:
dataset.head()

   age  gender  review education purchased
0   30  Female       1    School        No
1   68  Female       0        UG        No
2   70  Female       2        PG        No
3   72  Female       2        PG        No
4   16  Female       1        UG        No

In [407]:
dataset['education'].value_counts()

education
PG        18
School    16
UG        16
Name: count, dtype: int64

In [408]:
dataset['education'] = dataset['education'].map({"School":0, "UG":1, "PG":2})

In [409]:
dataset.head()

   age  gender  review  education purchased
0   30  Female       1          0        No
1   68  Female       0          1        No
2   70  Female       2          2        No
3   72  Female       2          2        No
4   16  Female       1          1        No

In [410]:
dataset['gender'].value_counts()

gender
Female    29
Male      21
Name: count, dtype: int64

In [411]:
dataset['gender'] = dataset['gender'].map({"Female":0, "Male":1})

In [412]:
dataset.head()

   age  gender  review  education purchased
0   30       0       1          0        No
1   68       0       0          1        No
2   70       0       2          2        No
3   72       0       2          2        No
4   16       0       1          1        No

In [413]:
dataset['purchased'].value_counts()

purchased
No     26
Yes    24
Name: count, dtype: int64

In [414]:
dataset['purchased'] = dataset['purchased'].map({"Yes":0, "No":1})

In [415]:
dataset.head()

   age  gender  review  education  purchased
0   30       0       1          0          1
1   68       0       0          1          1
2   70       0       2          2          1
3   72       0       2          2          1
4   16       0       1          1          1

In [416]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OrdinalEncoder

In [417]:
df1 = pd.read_csv("customer.csv")

In [418]:
df1.head()

   age  gender   review education purchased
0   30  Female  Average    School        No
1   68  Female     Poor        UG        No
2   70  Female     Good        PG        No
3   72  Female     Good        PG        No
4   16  Female  Average        UG        No

In [419]:
df2 = df1[['review', 'education', 'gender', 'purchased']]
df2.head()

    review education  gender purchased
0  Average    School  Female        No
1     Poor        UG  Female        No
2     Good        PG  Female        No
3     Good        PG  Female        No
4  Average        UG  Female        No

In [420]:
oe = OrdinalEncoder(categories = [["Poor", "Average", "Good"], ["School", "UG", "PG"], ["Male", "Female"], ["Yes", "No"]])
df3 = oe.fit_transform(df2)
df3

array([[1., 0., 1., 1.],
       [0., 1., 1., 1.],
       [2., 2., 1., 1.],
       [2., 2., 1., 1.],
       [1., 1., 1., 1.],
       [1., 0., 1., 0.],
       [2., 0., 0., 1.],
       [0., 0., 1., 0.],
       [1., 1., 1., 1.],
       [2., 1., 0., 0.],
       [2., 1., 1., 0.],
       [2., 1., 0., 0.],
       [0., 0., 0., 1.],
       [1., 0., 1., 1.],
       [0., 2., 0., 0.],
       [0., 1., 0., 1.],
       [0., 1., 0., 0.],
       [0., 1., 1., 0.],
       [2., 0., 0., 1.],
       [0., 2., 0., 0.],
       [1., 0., 1., 0.],
       [1., 2., 0., 1.],
       [0., 2., 1., 0.],
       [2., 0., 1., 1.],
       [1., 2., 1., 0.],
       [2., 0., 1., 1.],
       [0., 2., 1., 1.],
       [0., 2., 1., 1.],
       [0., 0., 0., 1.],
       [1., 1., 1., 0.],
       [1., 1., 0., 1.],
       [0., 0., 1., 0.],
       [1., 1., 0., 0.],
       [2., 2., 1., 0.],
       [1., 0., 0., 1.],
       [0., 0., 0., 0.],
       [2., 1., 1., 0.],
       [1., 2., 0., 0.],
       [2., 0., 1., 1.],
       [0., 2., 0., 1.],
       [2., 0., 0., 1.],
       [2., 2., 0., 0.],
       [2., 2., 1., 0.],
       [0., 2., 0., 1.],
       [1., 1., 1., 1.],
       [0., 2., 0., 0.],
       [0., 2., 1., 1.],
       [2., 2., 1., 0.],
       [2., 1., 1., 0.],
       [2., 1., 1., 1.]])

In [421]:
df4 = pd.DataFrame(df3, columns = ["review", "education", "gender", "pruchased"])
df4.head()

   review  education  gender  pruchased
0     1.0        0.0     1.0        1.0
1     0.0        1.0     1.0        1.0
2     2.0        2.0     1.0        1.0
3     2.0        2.0     1.0        1.0
4     1.0        1.0     1.0        1.0

In [422]:
df5 = pd.concat([df2,dataset], axis = 1)
df5.head()

,review,education,gender,purchased,age,gender,review,education,purchased
0,Average,School,Female,No,30,0,1,0,1
1,Poor,UG,Female,No,68,0,0,1,1
2,Good,PG,Female,No,70,0,2,2,1
3,Good,PG,Female,No,72,0,2,2,1
4,Average,UG,Female,No,16,0,1,1,1

In [423]:
# Now original data have to delete.

In [1]:
# Home work is -- "loan data" and "train data".

In [2]:
########################################################################################################################################################
########################################################################################################################################################
########################################################################################################################################################
########################################################################################################################################################
########################################################################################################################################################